app/controllers/friends_controller.rb

  def create
    @friend = Friend.new(friend_params)

    respond_to do |format|
      if @friend.save
---
INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "twitter", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @friend.update(friend_params)
---
UPDATE "friends" SET "phone" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["phone", "01220009867"], ["updated_at", "2023-02-04 10:47:36.328851"], ["id", 2]]